In [10]:
%load_ext dbt_magics

%config dbt.limit = 10

The dbt_magics extension is already loaded. To reload it, use:
  %reload_ext dbt_magics

In [11]:
import pandas as pd
#行の表示数の上限を撤廃
pd.set_option('display.max_rows', None)
#列の表示数の上限を撤廃
pd.set_option('display.max_columns', None)

In [12]:
%%dbt_show
select *
from {{ ref('customers') }}

,customer_id,first_name,last_name,first_order,most_recent_order,number_of_orders,customer_lifetime_value
0,1,Michael,P.,2018-01-01,2018-02-10,2,33.0
1,2,Shawn,M.,2018-01-11,2018-01-11,1,23.0
2,3,Kathleen,P.,2018-01-02,2018-03-11,3,65.0
3,6,Sarah,R.,2018-02-19,2018-02-19,1,8.0
4,7,Martin,M.,2018-01-14,2018-01-14,1,26.0
5,8,Frank,R.,2018-01-29,2018-03-12,2,45.0
6,9,Jennifer,F.,2018-03-17,2018-03-17,1,30.0
7,11,Fred,S.,2018-03-23,2018-03-23,1,3.0
8,12,Amy,D.,2018-03-03,2018-03-03,1,4.0
9,13,Kathleen,M.,2018-03-07,2018-03-07,1,26.0

'Rows: 10, Columns: 7'

In [13]:
%%dbt_show copydf
select *
from {{ ref('customers') }}

'DataFrame copied to clipboard.'

,customer_id,first_name,last_name,first_order,most_recent_order,number_of_orders,customer_lifetime_value
0,1,Michael,P.,2018-01-01,2018-02-10,2,33.0
1,2,Shawn,M.,2018-01-11,2018-01-11,1,23.0
2,3,Kathleen,P.,2018-01-02,2018-03-11,3,65.0
3,6,Sarah,R.,2018-02-19,2018-02-19,1,8.0
4,7,Martin,M.,2018-01-14,2018-01-14,1,26.0
5,8,Frank,R.,2018-01-29,2018-03-12,2,45.0
6,9,Jennifer,F.,2018-03-17,2018-03-17,1,30.0
7,11,Fred,S.,2018-03-23,2018-03-23,1,3.0
8,12,Amy,D.,2018-03-03,2018-03-03,1,4.0
9,13,Kathleen,M.,2018-03-07,2018-03-07,1,26.0

'Rows: 10, Columns: 7'

In [14]:
%%dbt_show df
select *
from {{ ref('customers') }}

"Results stored in variable 'df'."

In [15]:
df.describe()

       customer_id  number_of_orders
count    10.000000         10.000000
mean      7.200000          1.400000
std       4.211096          0.699206
min       1.000000          1.000000
25%       3.750000          1.000000
50%       7.500000          1.000000
75%      10.500000          1.750000
max      13.000000          3.000000

In [16]:
%%dbt_compile
select *
from {{ ref('orders') }}